controllers/ApiController.php

    public function actionFuelCost(){
        $request=[];
        $request = Yii::$app->request->post();
        //return $request;die();
        $contact = $request['sender'];
        $response = Person::find()->where(['contact' => $contact])->one();
---
SELECT * FROM `person` WHERE `contact`='+8801836729492'

                for($i = 2; $i < count($body); $i++){
                    $gen  = explode(",", $body[$i]);
                    //return $gen;die();
                    $gid  = Generator::find()->where(['g_code' => $gen[0]])->one()['id'];

                    $model = new McCost();
                    $model->project_id          = ProjectDetail::find()->where(['generator_id'=> $gid])->one()['project_id'];
---
SELECT * FROM `generator` WHERE `g_code`='DB1-110-2007-01'
SELECT * FROM `project_detail` WHERE `generator_id` IS NULL