controllers/PersonController.php

SELECT * FROM `person` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Person::findOne($id)) !== null) {