views/fc-cost/index.php

SELECT * FROM `project`
---
            'class'=>'form-control'
        ]) ?>

        <?= Html::dropDownList('p_id', $searchModel->project_id, ArrayHelper::map(Project::find()->all(), 'id','p_name'), [
            'class'=>'form-control'
        ]) ?>