views/rc-cost/repair.php

                ]);
        ?>

        <?= Html::dropDownList('p_id', $searchModel->project_id, ArrayHelper::map(Project::find()->all(), 'id','p_name'), [
            'class'=>'form-control'
        ]) ?>
---
SELECT * FROM `project`