views/mc-cost/maintenance.php

SELECT * FROM `project`
---
                ]);
        ?>

        <?= Html::dropDownList('p_id', $searchModel->project_id, ArrayHelper::map(Project::find()->all(), 'id','p_name'), [
            'class'=>'form-control'
        ]) ?>